# 1. Заполните массив элементами арифметической прогрессии. Её первый элемент, 
# разность и количество элементов нужно ввести с клавиатуры. 
# Формула для получения n-го члена прогрессии:
#     an = a1 + (n-1) * d.

# a1 = int(input("Введите первый элемент: "))
# n = int(input("Введите N"))
# d = int(input("Введите D: "))
# line = []
# for i in range(n):
#     #line[i] = a1 + i * d
#     line.append(a1 + i * d)
# print(line)


# 2. Определить индексы элементов массива (списка), значения которых принадлежат 
# заданному диапазону (т.е. не меньше заданного минимума и не больше заданного 
# максимума)

# line = [2,4,6,8,10,12,14,16,18,2]
# min = int(input("Введите минимальное значение: "))
# max = int(input("Введите максимальное значение: "))
# for i in range (len(line)):
#     if min < line[i] < max:
#         print(i)
        
